{
    "Michelle Menting": {
        "Objects Used to Prop Open a Window": "Dog bone, stapler,\n cribbage board, garlic press\n      because this window is loose--lacks\n suction, lacks grip.\n\n Bungee cord, bootstrap,\n dog leash, leather belt\n      because this window had sash cords.\n They frayed. They broke.\n\n Feather duster, thatch of straw, empty\n bottle of Elmer's glue\n      because this window is loud--its hinges clack\n open, clack shut.\n\n Stuffed bear, baby blanket,\n single crib newel\n      because this window is split. It's dividing\n in two.\n\n Velvet moss, sagebrush,\n willow branch, robin's wing\n      because this window, it's pane-less. It's only\n a frame of air."
    },
    "Lucia Cherciu": {
        "The New Church": "The old cupola glinted above the clouds, shone\n among fir trees, but it took him an hour\n\n for the half mile all the way up the hill. As he trailed,\n the village passed him by, greeted him,\n\n asked about his health, but everybody hurried\n to catch the mass, left him leaning against fences,\n\n measuring the road with the walking stick he sculpted.\n He yearned for the day when the new church\n\n would be built--right across the road. Now\n it rises above the moon: saints in frescoes\n\n meet the eye, and only the rain has started to cut\n through the shingles on the roof of his empty\n\n house. The apple trees have taken over the sky,\n sequestered the gate, sidled over the porch."
    },
    "Ted Kooser": {
        "Look for Me": "Look for me under the hood\n of that old Chevrolet settled in weeds\n at the end of the pasture.\n\n I'm the radiator that spent its years\n bolted in front of an engine\n shoving me forward into the wind.\n\n Whatever was in me in those days\n has mostly leaked away,\n but my cap's still screwed on tight\n\n and I know the names of all these\n tattered moths and broken grasshoppers\n the rest of you've forgotten.",
        "Post Office": "The wall of identical boxes into which\n our Aunt Sticky sorted the daily mail\n was at the far end of her dining room,\n and from the private side looked like\n a fancy wallpaper upon which peonies\n pushed through a white wooden trellis,\n or sometimes like crates of chickens\n stacked all the way to the ceiling.\n I'd learned by then - I was a little boy -\n that a thing can look like one thing\n on one day and another on another,\n depending on how you might be feeling.\n There were times when we were there,\n having our coffee and sweet rolls,\n when some woman on the lobby side\n would with a click unlock her box\n and leaning down, peer inside to see\n if she had mail, and see us at the table,\n Mother and Father, my sister and I\n and our postmistress aunt, and call out,\n \"Yoohoo, Sticky! I see you have company!\"\n and waggle her fingers, waving hello.",
        "Christmas Mail": "Cards in each mailbox,\n angel, manger, star and lamb,\n as the rural carrier,\n driving the snowy roads,\n hears from her bundles\n the plaintive bleating of sheep,\n the shuffle of sandals,\n the clopping of camels.\n At stop after stop,\n she opens the little tin door\n and places deep in the shadows\n the shepherds and wise men,\n the donkeys lank and weary,\n the cow who chews and muses.\n And from her Styrofoam cup,\n white as a star and perched\n on the dashboard, leading her\n ever into the distance,\n there is a hint of hazelnut,\n and then a touch of myrrh.",
        "Two": "On a parking lot staircase\n I met two fine-looking men\n descending, both in slacks\n and dress shirts, neckties\n much alike, one of the men\n in his sixties, the other\n a good twenty years older,\n unsteady on his polished shoes,\n a son and his father, I knew\n from their looks, the son with his\n right hand on the handrail,\n the father, left hand on the left,\n and in the middle they were\n holding hands, and when I neared,\n they opened the simple gate\n of their interwoven fingers\n to let me pass, then reached out\n for each other and continued on.",
        "The Giant Slide": "Beside the highway, the Giant Slide\n with its rusty undulations lifts\n out of the weeds. It hasn't been used\n for a generation. The ticket booth\n tilts to that side where the nickels shifted\n over the years. A chain link fence keeps out\n the children and drunks. Blue morning glories\n climb halfway up the stairs, bright clusters\n of laughter. Call it a passing fancy,\n this slide that nobody slides down now.\n Those screams have all gone east\n on a wind that will never stop blowing\n down from the Rockies and over the plains,\n where things catch on for a little while,\n bright leaves in a fence, and then are gone.",
        "A Blind Woman": "She had turned her face up into\n a rain of light, and came on smiling.\n\n The light trickled down her forehead\n and into her eyes. It ran down\n\n into the neck of her sweatshirt\n and wet the white tops of her breasts.\n\n Her brown shoes splashed on\n into the light. The moment was like\n\n a circus wagon rolling before her\n through puddles of light, a cage on wheels,\n\n and she walked fast behind it,\n exuberant, curious, pushing her cane\n\n through the bars, poking and prodding,\n while the world cowered back in a corner.",
        "An Epiphany": "I have seen the Brown Recluse Spider\n run with a net in her hand, or rather,\n what resembled a net, what resembled\n a hand. She ran down the gleaming white floor\n of the bathtub, trailing a frail swirl\n of hair, and in it the hull of a beetle\n lay woven. The hair was my wife's,\n long and dark, a few loose strands, a curl\n she might idly have turned on a finger,\n she might idly have twisted, speaking to me,\n and the legs of the beetle were broken.",
        "The China Painters": "They have set aside their black tin boxes,   \n scratched and dented,\n spattered with drops of pink and blue;   \n and their dried-up, rolled-up tubes   \n of alizarin crimson, chrome green,   \n zinc white, and ultramarine;\n their vials half full of gold powder;   \n stubs of wax pencils;\n frayed brushes with tooth-bitten shafts;   \n and have gone in fashion and with grace   \n into the clouds of loose, lush roses,   \n narcissus, pansies, columbine,   \n on teapots, chocolate pots,\n saucers and cups, the good Haviland dishes   \n spread like a garden\n on the white lace Sunday cloth,   \n as if their souls were bees\n and the world had been nothing but flowers.",
        "Depression Glass": "It seemed those rose-pink dishes   \n she kept for special company   \n were always cold, brought down   \n from the shelf in jingling stacks,   \n the plates like the panes of ice   \n she broke from the water bucket   \n winter mornings, the flaring cups   \n like tulips that opened too early\n and got bitten by frost. They chilled   \n the coffee no matter how quickly   \n you drank, while a heavy\n everyday mug would have kept   \n a splash hot for the better\n part of a conversation. It was hard   \n to hold up your end of the gossip   \n with your coffee cold, but it was   \n a special occasion, just the same,   \n to sit at her kitchen table\n and sip the bitter percolation\n of the past week's rumors from cups   \n it had taken a year to collect   \n at the grocery, with one piece free   \n for each five pounds of flour.",
        "Daddy Longlegs": "Here, on fine long legs springy as steel,\n a life rides, sealed in a small brown pill\n that skims along over the basement floor\n wrapped up in a simple obsession.\n Eight legs reach out like the master ribs\n of a web in which some thought is caught\n dead center in its own small world,\n a thought so far from the touch of things\n that we can only guess at it. If mine,\n it would be the secret dream\n of walking alone across the floor of my life\n with an easy grace, and with love enough\n to live on at the center of myself.",
        "Abandoned Farmhouse": "He was a big man, says the size of his shoes\n on a pile of broken dishes by the house;\n a tall man too, says the length of the bed\n in an upstairs room; and a good, God-fearing man,\n says the Bible with a broken back\n on the floor below the window, dusty with sun;\n but not a man for farming, say the fields\n cluttered with boulders and the leaky barn.\n\n A woman lived with him, says the bedroom wall\n papered with lilacs and the kitchen shelves\n covered with oilcloth, and they had a child,\n says the sandbox made from a tractor tire.\n Money was scarce, say the jars of plum preserves\n and canned tomatoes sealed in the cellar hole.\n And the winters cold, say the rags in the window frames.\n It was lonely here, says the narrow country road.\n\n Something went wrong, says the empty house\n in the weed-choked yard. Stones in the fields\n say he was not a farmer; the still-sealed jars\n in the cellar say she left in a nervous haste.\n And the child? Its toys are strewn in the yard\n like branches after a storm--a rubber cow,\n a rusty tractor with a broken plow,\n a doll in overalls. Something went wrong, they say.",
        "Late February": "The first warm day,\n and by mid-afternoon\n the snow is no more\n than a washing\n strewn over the yards,\n the bedding rolled in knots\n and leaking water,\n the white shirts lying\n under the evergreens.\n Through the heaviest drifts\n rise autumn's fallen\n bicycles, small carnivals\n of paint and chrome,\n the Octopus\n and Tilt-A-Whirl\n beginning to turn\n in the sun. Now children,\n stiffened by winter\n and dressed, somehow,\n like old men, mutter\n and bend to the work\n of building dams.\n But such a spring is brief;\n by five o'clock\n the chill of sundown,\n darkness, the blue TVs\n flashing like storms\n in the picture windows,\n the yards gone gray,\n the wet dogs barking\n at nothing. Far off\n across the cornfields\n staked for streets and sewers,\n the body of a farmer\n missing since fall\n will show up\n in his garden tomorrow,\n as unexpected\n as a tulip.",
        "So This Is Nebraska": "The gravel road rides with a slow gallop\n over the fields, the telephone lines\n streaming behind, its billow of dust\n full of the sparks of redwing blackbirds.\n\n On either side, those dear old ladies,\n the loosening barns, their little windows\n dulled by cataracts of hay and cobwebs\n hide broken tractors under their skirts.\n\n So this is Nebraska. A Sunday\n afternoon; July. Driving along\n with your hand out squeezing the air,\n a meadowlark waiting on every post.\n\n Behind a shelterbelt of cedars,\n top-deep in hollyhocks, pollen and bees,\n a pickup kicks its fenders off\n and settles back to read the clouds.\n\n You feel like that; you feel like letting\n your tires go flat, like letting the mice\n build a nest in your muffler, like being\n no more than a truck in the weeds,\n\n clucking with chickens or sticky with honey\n or holding a skinny old man in your lap\n while he watches the road, waiting\n for someone to wave to. You feel like\n\n waving. You feel like stopping the car\n and dancing around on the road. You wave\n instead and leave your hand out gliding\n larklike over the wheat, over the houses.",
        "In the Basement of the Goodwill Store": "In musty light, in the thin brown air\n of damp carpet, doll heads and rust,\n beneath long rows of sharp footfalls\n like nails in a lid, an old man stands\n trying on glasses, lifting each pair\n from the box like a glittering fish\n and holding it up to the light\n of a dirty bulb. Near him, a heap\n of enameled pans as white as skulls\n looms in the catacomb shadows,\n and old toilets with dry red throats\n cough up bouquets of curtain rods.\n\n You've seen him somewhere before.\n He's wearing the green leisure suit\n you threw out with the garbage,\n and the Christmas tie you hated,\n and the ventilated wingtip shoes\n you found in your father's closet\n and wore as a joke. And the glasses\n which finally fit him, through which\n he looks to see you looking back--\n two mirrors which flash and glance--\n are those through which one day\n you too will look down over the years,\n when you have grown old and thin\n and no longer particular,\n and the things you once thought\n you were rid of forever\n have taken you back in their arms.",
        "A Room in the Past": "It's a kitchen. Its curtains fill\n with a morning light so bright   \n you can't see beyond its windows   \n into the afternoon. A kitchen   \n falling through time with its things   \n in their places, the dishes jingling   \n up in the cupboard, the bucket   \n of drinking water rippled as if\n a truck had just gone past, but that truck   \n was thirty years. No one's at home   \n in this room. Its counter is wiped,   \n and the dishrag hangs from its nail,   \n a dry leaf. In housedresses of mist,   \n blue aprons of rain, my grandmother   \n moved through this life like a ghost,   \n and when she had finished her years,   \n she put them all back in their places\n and wiped out the sink, turning her back   \n on the rest of us, forever.",
        "A Letter in October": "Dawn comes later and later now,\n and I, who only a month ago\n could sit with coffee every morning\n watching the light walk down the hill\n to the edge of the pond and place\n a doe there, shyly drinking,\n\n then see the light step out upon\n the water, sowing reflections\n to either side--a garden\n of trees that grew as if by magic--\n now see no more than my face,\n mirrored by darkness, pale and odd,\n\n startled by time. While I slept,\n night in its thick winter jacket\n bridled the doe with a twist\n of wet leaves and led her away,\n then brought its black horse with harness\n that creaked like a cricket, and turned\n\n the water garden under. I woke,\n and at the waiting window found\n the curtains open to my open face;\n beyond me, darkness. And I,\n who only wished to keep looking out,\n must now keep looking in.",
        "Walking on Tiptoe": "Long ago we quit lifting our heels\n like the others--horse, dog, and tiger--\n though we thrill to their speed\n as they flee. Even the mouse\n bearing the great weight of a nugget\n of dog food is enviably graceful.\n There is little spring to our walk,\n we are so burdened with responsibility,\n all of the disciplinary actions\n that have fallen to us, the punishments,\n the killings, and all with our feet\n bound stiff in the skins of the conquered.\n But sometimes, in the early hours,\n we can feel what it must have been like\n to be one of them, up on our toes,\n stealing past doors where others are sleeping,\n and suddenly able to see in the dark."
    },
    "Grace Cavalieri": {
        "Wild Life": "Behind the silo, the Mother Rabbit\n hunches like a giant spider with strange calm:\n six tiny babies beneath, each\n clamoring for a sweet syringe of milk.\n This may sound cute to you, reading\n from your pulpit of plenty,\n but one small one was left out of reach,\n a knife of fur\n barging between the others.\n\n I watched behind a turret of sand. If\n I could have cautioned the mother rabbit\n I would. If I could summon the\n Bunnies to fit him in beneath\n the belly's swell\n I would. But instead, I stood frozen, wishing\n for some equity. This must be\n why it's called Wild Life because of all the\n crazed emotions tangled up in\n the underbrush within us.\n Did I tell you how\n the smallest one, black and trembling,\n hopped behind the kudzu\n still filigreed with wanting?\n\n Should we talk now of animal heritage, their species,\n creature development? And what do we say\n about form and focus--\n writing this when a stray goes hungry, and away.",
        "The Hot Dog Factory (1937)": "Of course now children take it for granted but once\n we watched boxes on a conveyor belt, sliding by,\n magically filled and closed, packed and wrapped.\n We couldn't get enough of it, running alongside the machine.\n In kindergarten Miss Haynes walked our class down\n Stuyvesant Avenue, then up Prospect Street\n to the hot dog factory. Only the girls got to go\n as the boys were too wild.\n We stood in line, wiggling with excitement as the man\n talked about how they made hot dogs, then he handed us\n one, and Jan dropped hers, so I broke mine in half.\n This was the happiest day of our lives,\n children whose mothers didn't drive, and had nowhere\n to go but school and home, to be taken to that street\n to watch the glittering steel and shining rubber belts moving,\n moving meats, readymade.  I wish I could talk with Jan,\n recalling the miracle and thrill of the hot dog factory,\n when she was alive, before it all stopped--\n bright lights, glistening motors, spinning wheels.",
        "Tomato Pies, 25 Cents": "Tomato pies are what we called them, those days,before Pizza came in, at my Grandmother's restaurant, in Trenton New Jersey.My grandfather is rolling meatballs in the back. He studied to be a priest in Sicily but saved his sister Maggie from marrying a bad guy by coming to America. Uncle Joey is rolling dough and spooning sauce. Uncle Joey, is always scrubbed clean, sobered up, in a white starched shirt, after cops delivered him home just hours before. The waitresses are helping themselves to handfuls of cash out of the drawer, playing the numbers with Moon Mullin and Shad, sent in from Broad Street. 1942, tomato pies with cheese, 25 cents. With anchovies, large, 50 cents. A whole dinner is 60 cents (before 6 pm). How the soldiers, bussed in from Fort Dix, would stand outside all the way down Warren Street, waiting for this new taste treat, young guys in uniform, lined up and laughing, learning Italian, before being shipped out to fight the last great war."
    },
    "Connie Wanek": {
        "Umbrella": "When I push your button\n you fly off the handle,\n old skin and bones,\n black bat wing.\n\n We're alike, you and I.\n Both of us\n resemble my mother,\n so fierce in her advocacy\n\n on behalf of\n the most vulnerable child\n who'll catch his death\n in this tempest.\n\n Such a headwind!\n Sometimes it requires\n all my strength\n just to end a line.\n\n But when the wind is at\n my back, we're likely\n to get carried away, and say\n something we can never retract,\n\n something saturated from the ribs\n down, an old stony\n word like ruin. You're what roof\n I have, frail thing,\n\n you're my argument\n against the whole sky.\n You're the fundamental difference\n between wet and dry.",
        "Monopoly": "We used to play, long before we bought real houses.\n A roll of the dice could send a girl to jail.\n The money was pink, blue, gold, as well as green,\n and we could own a whole railroad\n or speculate in hotels where others dreaded staying:\n the cost was extortionary.\n  \n At last one person would own everything,\n every teaspoon in the dining car, every spike\n driven into the planks by immigrants,\n every crooked mayor.\n But then, with only the clothes on our backs,\n we ran outside, laughing.",
        "Mysterious Neighbors": "Country people rise early as their distant lights testify. They don't hold water in common. Each house has a personal source, like a bank account, a stone vault. Some share eggs, some share expertise, and some won't even wave. A walk for the mail elevates the heart rate. Last November I saw a woman down the road walk out to her mailbox dressed in blaze orange cap to boot, a cautious soul. Bullets can't read her No Trespassing sign. Strange to think they're in the air like lead bees with a fatal sting. Our neighbor across the road sits in his kitchen with his rifle handy and the window open. You never know when. Once he shot a trophy with his barrel resting on the sill. He's in his seventies, born here, joined the Navy, came back. Hard work never hurt a man until suddenly he was another broken tool. His silhouette against the dawn droops as though drought-stricken, each step deliberate, down the driveway to his black mailbox, prying it open. Checking a trap.",
        "Radiator": "Mittens are drying on the radiator,\n boots nearby, one on its side.\n Like some monstrous segmented insect\n the radiator elongates under the window.\n\n Or it is a beast with many shoulders\n domesticated in the Ice Age.\n How many years it takes\n to move from room to room!\n\n Some cage their radiators\n but this is unnecessary\n as they have little desire to escape.\n\n Like turtles they are quite self-contained.\n If they seem sad, it is only the same sadness\n we all feel, unlovely, growing slowly cold.",
        "Amaryllis": "A flower needs to be this size to conceal the winter window, and this color, the red of a Fiat with the top down, to impress us, dull as we've grown.  Months ago the gigantic onion of a bulb half above the soil stuck out its green tongue and slowly, day by day, the flower itself entered our world,  closed, like hands that captured a moth, then open, as eyes open, and the amaryllis, seeing us, was somehow undiscouraged. It stands before us now  as we eat our soup; you pour a little of your drinking water into its saucer, and a few crumbs of fragrant earth fall onto the tabletop.",
        "Butter": "Butter, like love, \nseems common enough \nyet has so many imitators. \nI held a brick of it, heavy and cool, \nand glimpsed what seemed like skin \nbeneath a corner of its wrap; \nthe decolletage revealed \na most attractive fat! \n\nAnd most refined. \nNot milk, not cream, \nnot even creme de la creme. \nIt was a delicacy which assured me \nthat bliss follows agitation, \nthat even pasture daisies \nthrough the alchemy of four stomachs \nmay grace a king's table. \n\nWe have a yellow bowl near the toaster \nwhere summer's butter grows \nsoft and sentimental. \nWe love it better for its weeping, \nits nostalgia for buckets and churns \nand deep stone wells, \nfor the press of a wooden butter mold \nshaped like a swollen heart.",
        "Hartley Field": "And place is always and only place\nAnd what is actual is actual only for one time\nAnd only for one place . . .\nT. S. Eliot\n\n\n\nThe wind cooled as it crossed the open pond\n and drove little waves toward us,\n brisk, purposeful waves\n that vanished at our feet, such energy\n thwarted by so little elevation.\n The wind was endless, seamless,\n old as the earth.\n                            Insects came\n to regard us with favor. I felt them alight,\n felt their minute footfalls.\n I was a challenge, an Everest . . .\n\n And you, whom I have heard breathe all night,\n sigh through the water of sleep\n with vestigial gills . . .\n\n A pair of dragonflies drifted past us, silent,\n while higher up two bullet-shaped jets\n dragged their roars behind them\n on unbreakable chains. It seemed a pity\n we'd given up the sky to them, but I understand so little.\n Perhaps it was necessary.\n\n All our years together--\n and not just together. Surely by now\n we have the same blood type, the same myopia.\n Sometimes I think we're the same sex,\n the one in the middle of man and woman,\n born of both as every child is.\n\n The waves came to us, one each heartbeat,\n and lay themselves at our feet.\n The swelling goes down.\n The fever cools.\n There, where the Hartleys grew lettuce eighty years ago\n bear and beaver, fox and partridge\n den and nest and hunt\n and are hunted. I wish I had the means\n to give all the north back to itself, to let the pines\n rise in the hayfield and the lilacs go wild.\n But then where would we live?\n\n I wanted that hour with you all winter--\n I thought of it while I worked,\n before I slept and when I woke,\n a time when the tangled would straighten,\n when contrition would become benediction:\n the positive hour, shining like mica.\n At last the wind brought it to us across the pond,\n then took it up again, every last minute."
    },
    "January Gill O'Neil": {
        "Sunday": "You are the start of the week\n or the end of it, and according\n to The Beatles you creep in\n like a nun. You're the second\n full day the kids have been\n away with their father, the second\n full day of an empty house.\n Sunday, I've missed you. I've been\n sitting in the backyard with a glass\n of Pinot waiting for your arrival.\n Did you know the first Sweet 100s\n are turning red in the garden,\n but the lettuce has grown\n too bitter to eat. I am looking\n up at the bluest sky I have ever seen,\n cerulean blue, a heaven sky\n no one would believe I was under.\n You are my witness. No day\n is promised. You are absolution.\n You are my unwritten to-do list,\n my dishes in the sink, my brownie\n breakfast, my braless day."
    },
    "Joy Harjo": {
        "Invisible Fish": "Invisible fish swim this ghost ocean now described by waves of sand, by water-worn rock. Soon the fish will learn to walk. Then humans will come ashore and paint dreams on the dying stone. Then later, much later, the ocean floor will be punctuated by Chevy trucks, carrying the dreamers' decendants, who are going to the store.",
        "Don't Bother the Earth Spirit": "Don't bother the earth spirit who lives here. She is working on a story. It is the oldest story in the world and it is delicate, changing. If she sees you watching she will invite you in for coffee, give you warm bread, and you will be obligated to stay and listen. But this is no ordinary story. You will have to endure earthquakes, lightning, the deaths of all those you love, the most blinding beauty. It's a story so compelling you may never want to leave; this is how she traps you. See that stone finger over there? That is the only one who ever escaped.",
        "Tobacco Origin Story, Because Tobacco Was a Gift Intended to Walk Alongside Us to the Stars": "From a story of how the tobacco plant came to our people, told to me by my cousin George Coser Jr.\n\n\n\nIt was way back, before there was a way back\n When time threaded earth and sky.\n Children were conceived, were born, grew, and walked tall\n In what we now call a day.\n There must have been two suns, a bright moon, somehow\n We had more light than now, sheen\n Of falling in love playing about Earth's body\n In a wild flicker which lit\n Us up. We who were this planet and yearned for touch.\n Every planted thought grew plant\n Ladders to the stars, way back, before there was\n No way back, Miss Mary Mack.\n We used to sing along the buttons of her\n Dress. Our babies are always\n Our babies. Even back then when time waved through\n The corn. We knew our plants like\n Relatives. Their stories were our stories, there\n Were songs for everything -- I\n Should say \"are\" songs for every transformation\n They link between way back and\n Now, the forever now, a time when a young\n Mvskoke man and woman\n Walked through the shimmer of the early evening.\n They had become as one song.\n They lay down when it was dark. I can hear their\n Intimate low-voice talking.\n How they tease one another with such gut love.\n Earth makes a bed, with pillow\n Mounds. And it is there as the night insects sing\n They conceived their first child. They\n Will look back as they walk East toward the sunrise.\n The raw stalks of beginning\n Will drink the light, root deeply dark into earth.\n In the tracks of their loving\n The plant-child emerges, first the seed head, then\n Leafy, long male body and the white female\n Flowers of tobacco, or\nHece, as the people called it when it called\n To them. Come here. We were brought\n To you from those who love you. We will help you.\n And that's how it began, way\n Back, when we knew how to hear the songs of plants\n And could sing back, like now\n On paper, with marks like bird feet, but where are\n Our ears? They have grown to fit\n Around earbuds, to hear music made for cold\n Cash, like our beloved smoke-\n Making threaded with addiction and dead words.\n Sing this song back to me, girl.\n In the moonlight, tobacco plant had silver\n Moon buttons all up her back.\n We're getting dressed to go plant new songs with words.\n Our sun is dimming faster.\n Mvto hece, mvto hvse, mvto e -- \n Kanvchaga, mvto ah",
        "Redbird Love": "We watched her grow up.\n She was the urgent chirper,\n Fledgling flier.\n And when spring rolled\n Out its green\n She'd grown\n Into the most noticeable\n Bird-girl.\n Long-legged and just\n The right amount of blush\n Tipping her wings, crest\n And tail, and\n She knew it\n In the bird parade.\n We watched her strut.\n She owned her stuff.\n The males perked their armor, greased their wings,\n And flew sky-loop missions\n To show off\n For her.\n In the end\n There was only one.\n Isn't that how it is for all of us?\n There's that one you circle back to -- for home.\n This morning\n The young couple scavenges seeds\n On the patio.\n She is thickening with eggs.\n Their minds are busy with sticks the perfect size, tufts of fluff\n Like dandelion, and other pieces of soft.\n He steps aside for her, so she can eat.\n Then we watch him fill his beak\n Walk tenderly to her and kiss her with seed.\n The sacred world lifts up its head\n To notice -- \n We are double-, triple-blessed.",
        "How to Write a Poem in a Time of War": "You can't begin just anywhere. It's a wreck.\n\n                                                                                        Shrapnel and the eye\n\n Of a house, a row of houses. There's a rat scrambling\n\n From light with fleshy trash in its mouth. A baby strapped to its mother's back\n\n Cut loose.                                                                     Soldiers crawl the city,\n\n\n The river, the town, the village,\n\n                                       The bedroom, our kitchen. They eat everything.\n Or burn it.\n\n They kill what they cannot take. They rape. What they cannot kill they take.\n\n Rumors fall like rain.\n\n                                      Like bombs.\n\n                  Like mother and father tears swallowed for restless peace.\n\n\n                                     Like sunset slanting toward a moonless midnight.\n\n Like a train blown free of its destination.         Like a seed fallen where\n\n There is no chance of trees                 or anyplace       for birds to live.\n\n\nNo, start here.                           Deer peer from the edge of the woods.\n\n                                                                         We used to see woodpeckers\n\n The size of the sun, redbirds, and were greeted\n\n                                           By chickadees with their good morning songs.\n\n We'd started to cook outside slippery with dew and laughter, ah those smoky sweet sunrises.\n\n We tried to pretend war wasn't going to happen.\n\n Though they began building their houses all around us and demanding \nmore.\n\n They started teaching our children their god's story,\n\n                                                                A story in which we'd always be slaves.\n\nNo. Not here.\n\n You can't begin here.\n\n This is memory shredded because it is impossible to hold by words, even poetry.\n\n\n These memories were left here with the trees:\n\n The torn pocket of your daughter's hand-sewn dress,\n\n The sash, the lace.\n\n The baby's delicately beaded moccasin still connected to the foot,\n\n A young man's note of promise to his beloved --\n\n\n                                                                              No! This is not the best place to begin.\n\n\n Everyone was asleep, despite the distant bombs. Terror had become the familiar stranger.\n\n Our beloved twin girls curled up in their nightgowns, next to their father and me.\n\n\n\nIf we begin here, none of us will make it to the end\n\n                                                                                                               Of the poem.\n\n\n Someone has to make it out alive, sang a grandfather to his grandson,\n\n His granddaughter, as he blew his most powerful song into the hearts of the children.\n\n There it would be hidden from the soldiers,\n\n Who would take them miles, rivers, mountains from the navel cord place\n\n Of the origin story.\n\n He knew one day, far day, the grandchildren would return, \ngenerations later\n\n Over slick highways                             constructed over old trails\n\n Through walls of laws meant to hamper or destroy, over the \nlibraries of\n\n The ancestors in the winds, born in stones.\n\n\n His song brings us to his home place in these smoky hills.\n\n\nBegin here.",
        "Everybody Has a Heartache: A Blues": "In the United terminal in Chicago at five on a Friday afternoonThe sky is breaking with rain and wind and all the flightsAre delayed forever. We will never get to where we are goingAnd there's no way back to where we've been.The sun and the moon have disappeared to an island far from \nanywhere.Everybody has a heartache -- The immense gatekeeper of Gate Z-100 keeps his cool.This guardian of the sky teases me and makes me smile through the mess,Building up his airline by stacking it against the company I usually travel:Come on over to our side, we'll treat you nice.I laugh as he hands me back my ticket, then he turns to charmThe next customer, his feet tired in his minimum wage shoes.Everybody has a heartache -- The man with his head bobbing to music no one else can hear has that satisfiedFeel -- a full belly of sweet and a wife who sings heartache to sleep.In his luggage (that will be lost and never found) is a musty dream of flyingSolo to Africa, with a stop on the return to let go the stories too difficult toCarry home. He'll take off his shoes to walk in a warm, tropical sea.He'll sing to the ancestors:Take me home to mama. No one cooks like her.But all the mamas worked to the bone gone too young. Broken by The Man.Everybody has a heartache --  Everyone's mouthing fried, sweet, soft and fat,While we wait for word in the heart of the scrambled beast.The sparkle of soda wets the dream core.That woman over there the color of broth did what she was told.It's worked out well as can be expected in a worldWhere she was no beauty queen and was never seen,Always in the back of someplace in the back -- She holds the newest baby. He has croup.Shush, shush. Go to sleep, my little baby sheepie.He sits up front of her with his new crop of teeth.Everybody has a heartache -- This man speaks to no one, but his body does.Half his liver is swollen with anger; the other half is tryingTo apologize -- What a mess I've made of history, he thinks without thinking.Mother coming through the screen door, her clothes torn,Whimpering: It's okay baby, please don't cry.Don't cry. Baby don't cry.And he never cries again. Everybody has a heartache --  Baby girl dressed to impress, toddles about with lace on this and ruffle on that -- Her mother's relatives are a few hundred miles away poised to \nwelcome.They might as well live on a planet of ice cream.She's a brand new wing, grown up from a family's broken hope.Dance girl, you carry our joy.Just don't look down. Everybody has a heartache -- Good-looking punk girl taps this on her screento a stranger she has never seen:Just before dawn, you're high again beneath a marbled sky,I was slick fine leather with a drink in my hand.Flying with a comet messenger nobody sees.The quick visitor predicts that the top will be the bottomAnd the bottom will flatten and dive into the sea.I want to tell her:You will dine with the lobster king, andYou will dance with crabs clicking castanets. You will sleep-Walk beyond the vestibule of sadness with a strangerYou have loved for years.Everybody has a heartache -- This silence in the noise of the terminal is a mountain of bison skulls.Nobody knows, nobody sees -- Unless the indigenous are dancing powwow all decked out in flash and beautyWe just don't exist. We've been dispersed to an outlaw cowboy tale.What were they thinking with all those guns and those handcuffsIn a size for babies?They just don't choose to remember.We're here.In the terminal of stopped time I went unsteady to the beat,Driven by a hungry spirit who is drunk with words and songs.What can I do?I have to take care of it.The famished spirit eats fire, poetry, and rain; it only wants love.I argue:You want love?Do you even know what it looks like, smells like?But you cannot argue with hungry spirits.I don't know exactly where I'm going; I only know where I've been,I want to tell the man who sifted through the wreck to find us hereIn the blues shack of disappeared history -- I feel the weight of his heart against my cheek.His hand is on my back pulling me to him in the dark, to a placeNo soldiers can reach.I hear the whoop-cries of warriors calling fire for a stand Against the brutality of forgetfulness -- Everybody has a heartache -- We will all find our way, no matter fire leaping through holes in jump time,No matter earthquake, or the breaking of love spilling over the dreck of matterIn the ether, stacking one burdenAgainst the other -- We have a heartache.",
        "An American Sunrise": "We were running out of breath, as we ran out to meet ourselves. We\n were surfacing the edge of our ancestors' fights, and ready to strike.\n It was difficult to lose days in the Indian bar if you were straight.\n Easy if you played pool and drank to remember to forget. We\n made plans to be professional -- and did. And some of us could sing\n so we drummed a fire-lit pathway up to those starry stars. Sin\n was invented by the Christians, as was the Devil, we sang. We\n were the heathens, but needed to be saved from them -- thin\n chance. We knew we were all related in this story, a little gin\n will clarify the dark and make us all feel like dancing. We\n had something to do with the origins of blues and jazz\n I argued with a Pueblo as I filled the jukebox with dimes in June,\n forty years later and we still want justice. We are still America. We\n know the rumors of our demise. We spit them out. They die\n soon.",
        "Eagle Poem": "To pray you open your whole self\n To sky, to earth, to sun, to moon\n To one whole voice that is you.\n And know there is more\n That you can't see, can't hear;\n Can't know except in moments\n Steadily growing, and in languages\n That aren't always sound but other\n Circles of motion.\n Like eagle that Sunday morning\n Over Salt River. Circled in blue sky\n In wind, swept our hearts clean\n With sacred wings.\n We see you, see ourselves and know\n That we must take the utmost care\n And kindness in all things.\n Breathe in, knowing we are made of\n All this, and breathe, knowing\n We are truly blessed because we\n Were born, and die soon within a\n True circle of motion,\n Like eagle rounding out the morning\n Inside us.\n We pray that it will be done\n In beauty.\n In beauty.",
        "Insomnia and the Seven Steps to Grace": "At dawn the panther of the heavens peers over the edge of the world.   \n She hears the stars gossip with the sun, sees the moon washing her lean   \n darkness with water electrified by prayers. All over the world there are those   \n who can't sleep, those who never awaken.   \n\n My granddaughter sleeps on the breast of her mother with milk on   \n her mouth. A fly contemplates the sweetness of lactose.\n\n Her father is wrapped in the blanket of nightmares. For safety he   \n approaches the red hills near Thoreau. They recognize him and sing for   \n him.   \n\n Her mother has business in the house of chaos. She is a prophet dis-   \n guised as a young mother who is looking for a job. She appears at the   \n door of my dreams and we put the house back together.   \n\n Panther watches as human and animal souls are lifted to the heavens by   \n rain clouds to partake of songs of beautiful thunder.   \n\n Others are led by deer and antelope in the wistful hours to the vil-   \n lages of their ancestors. There they eat cornmeal cooked with berries   \n that stain their lips with purple while the tree of life flickers in the sun.   \n\n It's October, though the season before dawn is always winter. On the   \n city streets of this desert town lit by chemical yellow travelers   \n search for home.   \n\n Some have been drinking and intimate with strangers. Others are   \n escapees from the night shift, sip lukewarm coffee, shift gears to the   \n other side of darkness.   \n\n One woman stops at a red light, turns over a worn tape to the last   \n chorus of a whispery blues. She has decided to live another day.   \n\n The stars take notice, as do the half-asleep flowers, prickly pear and   \n chinaberry tree who drink exhaust into their roots, into the earth.   \n\n She guns the light to home where her children are asleep and may   \n never know she ever left. That their fate took a turn in the land of   \n nightmares toward the sun may be untouchable knowledge.   \n\n It is a sweet sound.   \n\n The panther relative yawns and puts her head between her paws.   \n She dreams of the house of panthers and the seven steps to grace.",
        "Perhaps the World Ends Here": "The world begins at a kitchen table. No matter what, we must eat to live.\n\n The gifts of earth are brought and prepared, set on the table. So it has been since creation, and it will go on.\n\n We chase chickens or dogs away from it. Babies teethe at the corners. They scrape their knees under it.\n\n It is here that children are given instructions on what it means to be human. We make men at it, we make women.\n\n At this table we gossip, recall enemies and the ghosts of lovers.\n\n Our dreams drink coffee with us as they put their arms around our children. They laugh with us at our poor falling-down selves and as we put ourselves back together once again at the table.\n\n This table has been a house in the rain, an umbrella in the sun.\n\n Wars have begun and ended at this table. It is a place to hide in the shadow of terror. A place to celebrate the terrible victory.\n\n We have given birth on this table, and have prepared our parents for burial here.\n\n At this table we sing with joy, with sorrow. We pray of suffering and remorse. We give thanks.\n\n Perhaps the world will end at the kitchen table, while we are laughing and crying, eating of the last sweet bite.",
        "My House is the Red Earth": "My house is the red earth; it could be the center of the world. I've heard New York, Paris, or Tokyo called the center of the world, but I say it is magnificently humble. You could drive by and miss it. Radio waves can obscure it. Words cannot construct it, for there are some sounds left to sacred wordless form. For instance, that fool crow, picking through trash near the corral, understands the center of the world as greasy strips of fat. Just ask him. He doesn't have to say that the earth has turned scarlet through fierce belief, after centuries of heartbreak and laughter--he perches on the blue bowl of the sky, and laughs."
    },
    "John Ashbery": {
        "The One Thing That Can Save America": "Is anything central?\n Orchards flung out on the land,\n Urban forests, rustic plantations, knee-high hills?\n Are place names central?\n Elm Grove, Adcock Corner, Story Book Farm?\n As they concur with a rush at eye level\n Beating themselves into eyes which have had enough\n Thank you, no more thank you.\n And they come on like scenery mingled with darkness\n The damp plains, overgrown suburbs,\n Places of known civic pride, of civil obscurity.\n  \n These are connected to my version of America\n But the juice is elsewhere.\n This morning as I walked out of your room\n After breakfast crosshatched with\n Backward and forward glances, backward into light,\n Forward into unfamiliar light,\n Was it our doing, and was it\n The material, the lumber of life, or of lives\n We were measuring, counting?\n A mood soon to be forgotten\n In crossed girders of light, cool downtown shadow\n In this morning that has seized us again?\n  \n I know that I braid too much on my own\n Snapped-off perceptions of things as they come to me.\n They are private and always will be.\n Where then are the private turns of event\n Destined to bloom later like golden chimes\n Released over a city from a highest tower?\n The quirky things that happen to me, and I tell you,\n And you know instantly what I mean?\n What remote orchard reached by winding roads\n Hides them? Where are these roots?\n  \n It is the lumps and trials\n That tell us whether we shall be known\n And whether our fate can be exemplary, like a star.\n All the rest is waiting\n For a letter that never arrives,\n Day after day, the exasperation\n Until finally you have ripped it open not knowing what it is,\n The two envelope halves lying on a plate.\n The message was wise, and seemingly\n Dictated a long time ago.\n Its truth is timeless, but its time has still\n Not arrived, telling of danger, and the mostly limited\n Steps that can be taken against danger\n Now and in the future, in cool yards,\n In quiet small houses in the country,\n Our country, in fenced areas, in cool shady streets.",
        "[A blue anchor grains of grit in a tall sky sewing]": "A blue anchor grains of grit in a tall sky sewing\n\n I inch and only sometimes as far as the twisted pole gone in spare colors\n\n Too late the last express passes through the dust of gardens",
        "The Short Answer": "I am forced to sleepwalk much of the time.\n We hold on to these old ways, are troubled\n sometimes and then the geyser goes away,\n time gutted. In and of itself there is\n no great roar, force pitted against force that\n makes up in time what it loses in speed.\n The waterfalls, the canyon, a royal I-told-you-so\n comes back to greet us at the beginning.\n How was your trip? Oh I didn't last\n you see, folded over like the margin\n of a dream of the thing-in-itself. Well, and\n what have we come to? A paper-thin past,\n just so, and 'tis pity. We regurgitate\n old anthems and what has come to pass, and why\n dwell on these. Why make things more difficult\n than they already are? Because if it's boring\n in a different way, that'll be interesting too.\n That's what I say.\n  \n That rascal, he jumped over the fence.\n I'm wiping my pince-nez now. Did you ever hear from\n the one who said he'd be back once it was over,\n who eluded me even in my sleep? That was a particularly\n promising time, we thought. Now the sun's out\n and it's raining again. Just like a day from\n the compendium. I'll vouch for you,\n and we can go on scrolling as though nothing had risen,\n the horizon forest looks back at us. The preacher\n shook his head, the evangelist balanced two spools\n at the end of his little makeshift rope. We'd gone too far.\n We'd have to come back in a day or so.",
        "A Worldly Country": "Not the smoothness, not the insane clocks on the square,\n the scent of manure in the municipal parterre,\n not the fabrics, the sullen mockery of Tweety Bird,\n not the fresh troops that needed freshening up. If it occurred\n in real time, it was OK, and if it was time in a novel\n that was OK too. From palace and hovel\n the great parade flooded avenue and byway\n and turnip fields became just another highway.\n Leftover bonbons were thrown to the chickens\n and geese, who squawked like the very dickens.\n There was no peace in the bathroom, none in the china closet\n or the banks, where no one came to make a deposit.\n In short all hell broke loose that wide afternoon.\n By evening all was calm again. A crescent moon\n hung in the sky like a parrot on its perch.\n Departing guests smiled and called, \"See you in church!\"\n For night, as usual, knew what it was doing,\n providing sleep to offset the great ungluing\n that tomorrow again would surely bring.\n As I gazed at the quiet rubble, one thing\n puzzled me: What had happened, and why?\n One minute we were up to our necks in rebelliousness,\n and the next, peace had subdued the ranks of hellishness.\n\n So often it happens that the time we turn around in\n soon becomes the shoal our pathetic skiff will run aground in.\n And just as waves are anchored to the bottom of the sea\n we must reach the shallows before God cuts us free.",
        "This Room": "The room I entered was a dream of   this room.\n Surely all those feet on the sofa were mine.\n The oval portrait\n of   a dog was me at an early age.\n Something shimmers, something is hushed up.\n\n We had macaroni for lunch every day\n except Sunday, when a small quail was induced\n to be served to us. Why do I tell you these things?\n You are not even here.",
        "Bunch of Stuff": "To all events I squirted youknowing this not to be this came to passwhen we were out and it looked good.Why wouldn't you want a fresh pieceof outlook to stand in down the years?See, your house, a former human energy construction,crashed with us for a few days in Mayand sure enough, the polar inscapebrought about some easier poems,which I guessed was a good thing. At leastsome of us were relaxed, Steamboat Bill included.He didn't drink nothing.It was one thingto be ready for their challenge, quite another to accept it.And if I had a piece of advice for you, this is it:Poke fun at balm, then suffer lethargyto irradiate its shallow flood in the new packagingour enemies processed. They should know.The Gold Dust Twins never stopped supplicating Hoosiersto limn the trail. There's no Shakespeare.Through the window, Casanova.Couldn't get to sleep in the dumb incidentof those days, crimping the frozen feet of Lincoln.",
        "By Guess and by Gosh": "O awaken with methe inquiring goodbyes.Ooh what a messy businessa tangle and a muddle(and made it seem quite interesting).He ticks them off:leisure top,a different ride home,whispering, in a way,whispered whiskers,so many of the things you have to share.But I was getting on,and that's what you don't need.I'm certainly sorry about scaring your king,if indeed that's what happened to him.You get Peanuts and War and Peace,some in rags, some in jags, some invelvet gown. They wantthe other side of the printing plant.There were concerns.Say hi to jock itch, leadership principles,urinary incompetence.Take that, perfect pitch.And say a word for the president,for the scholar magazines, papers, a streaming.Then you are interested in poetry.",
        "Alms for the Beekeeper": "He makes better errors that way.Pass it around at breakfast:the family and all, down there with a proximate sense of power,lawyering up. Less log-heavy, your text-strategybeat out other options, is languid.Duets in the dust start up,begin. Again.He entered the firm at night.The 26th is a Monday.",
        "Blueprints and Others": "The man across the street seems happy,or pleased. Sometimes a porter evades the grounds.After you play a lot with the militaryyou are my own best customer.I've done five of that.Make my halloween. Ask me not to say it.The old man wants to see you -- now.That's all right, but find your own.Do you want to stop using these?Last winning people told me to sit on the urinal.Do not put on others what you can put on yourself.How to be in the city my loved one.Men in underwear    ...    A biography fieldlike where we live in the mountains,a falling. Yes I know you have.Troves of merchandise, you know, \"boomer buzz.\"Hillbilly sculptures of the outside.(They won't see anybody.)",
        "Dramedy": "Things I left on your paper:one of the craziest episodes that ever overtook me.Do you like espionage? A watered charm?My pod cast aside, I'll walk in the human street,protect the old jib from new miniseries.I could swear it movedin incomplete back yardsto endorse the conversation, request to be strapped in.Then it will be time to take the stepgiving fragile responses,and finally he wrote the day.It happened in the waterso that was nice.It comes ready conflated:vanilla for get lost, flavor of the timeof his sponsor's destiny. Be on that sofa.I was crossing the state line as they were reburying the stuff.You break the time lock, the bride's canister    ...    but we did say that we'd be back.",
        "Late-ish": "The girl in the green ski chasuble\n hasn't yet graduated from radio school.\n Let's pay attention.\n\n Looking ahead, why, he waved his mouth along.\n Doesn't life get difficult in the summer?\n The divine medicine for it collapsed\n in front of the shortstop,\n who took off like a battalion.\n\n Crowds of older people who would read this\n happily, willingly, then walking into night's embrace,\n then kiss. \"To turn you out, to turn you out!\"\n Sometimes an arm is accused:\n You could have felt it, the blue shirts,\n phlegm central, four times a night.\n But what does that get me?\n Light refreshments.\n\n When the suburban demonstration kind of shrunk\n you put your foot out,\n leave it or kiss it\n or even two years ago,\n Charmaine here tells us.\n I think I should stay ...    \n\n Cross-eyed sonofabitch ...    \n He liked him, he could tell. A de-happening.\n The gangster no longer wanted to sleep with him,\n but what the heck. With time off\n for actual fuzz collected ... All right, boys.\n Cheap murders, peach driven ... I seen enough of those\n samples along the way.",
        "Day Bump": "Whether the harborline or the east shoreline\n consummated it was nobody's biz until you got there,\n eyelids ashimmer, content with one more dispensation\n from blue above. And just like we were saying,\n the people began to show some interest\n in the mud-choked harbor. It could be summer again\n for all anyone in our class knew.\n Yeah, that's right. Bumped from our dog-perch,\n we'd had to roil with the last of them.\n\n It's taken a while since I've been here,\n but I'm resolved. What, didn't I print,\n little piles of notes, slopes almost Sicilian?\n Here is my friend:\n Socks for comfort (now boys) will see later. Did they come?\n The inner grocery had to take three sets of clips away.\n Speaking to him of intricate family affairs.\n I'm not what you think. Stay preconscious.\n It's just the \"flooding of the council.\" No need to feel afraid.",
        "People Behaving Badly a Concern": "Aggressive panhandling, public urination, verbal threats,\n public nudity and violation of the open container law\n followed us down the days, for why\n are we here much longer,\n or even this long? I ask you\n to be civil and not interrupt night's business.\n\n It was fun getting used to you,\n who couldn't have been more nicer.\n This was as modern as it had ever been.\n They were influenced by him: some dirty magazine\n on the air tonight. (Amid the chaos, reports of survivors.)\n\n Didn't the flowers' restoration cat fugue keep spilling,\n and like that? It wouldn't be the first time, either.\n The pro-taffeta get up and laugh,\n investigate or communicate. The night you were\n going to stay up late, others will kiss,\n and he talks about you, and I don't know what.\n Come in, anyway,\n and don't lack for tales of the Assertion.\n\n We're talking civilian unrest.\n Yes, well, maybe you should take one.\n\n (Do not bite or chew.)",
        "Mean Particles": "Sometimes something like a second\n washes the base of this street.\n The father and his two assistants\n are given permission to go.\n One of them, a woman, asks, \"Why\n did we come here in the first place,\n to this citadel of dampness?\"\n\n Some days are worse than others,\n even if we can't believe in them.\n But that was never a concern of mine,\n reasoned the patient.\n\n Sing, scroll, or never be blasted by us\n into marmoreal meaning, or the fist for it.\n Kudos to the prince who journeyed here\n to negotiate our release, if you can believe it.\n\n You're right. The ballads are retreating\n back into the atmosphere.\n They won't be coming round again.\n Make your peace."
    }
}